<a href="https://colab.research.google.com/github/PrasadReddyGaddam/PYTHON/blob/master/Assignment_9(05_06_20).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

CSE-221710301019-Gaddam Prasad Reddy

In [2]:
#1.Write a Python program to add, subtract, multiple and divide two Pandas Series. 
# Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

import pandas as pd
a = pd.Series([2,4,6,8,10])
b = pd.Series([1,3,5,7,9])
data = {"ADD":a+b,"SUB":a-b,"MUL":a*b,"DIV":a/b}
df = pd.DataFrame(data)
df

   ADD  SUB  MUL       DIV
0    3    1    2  2.000000
1    7    1   12  1.333333
2   11    1   30  1.200000
3   15    1   56  1.142857
4   19    1   90  1.111111

In [22]:
#2. Write a Pandas program to compute the minimum, 25th percentile, median, 75th, and maximum of a given series. 
import numpy as np
x = np.random.RandomState(100)
y = pd.Series(x.normal(10,4,20))
print(y)
z= np.percentile(y,[0,25,50,75,100])
z

0      3.000938
1     11.370722
2     14.612143
3      8.990256
4     13.925283
5     12.056875
6     10.884719
7      5.719827
8      9.242017
9     11.020006
10     8.167892
11    11.740654
12     7.665620
13    13.267388
14    12.690883
15     9.582355
16     7.874878
17    14.118931
18     8.247458
19     5.526727
dtype: float64

array([ 3.00093811,  8.09463867, 10.23353705, 12.21537733, 14.61214321])

In [37]:
#3.Write a Pandas program to get the items of a given series not present in another given series. 
n = pd.Series([1,2,3,4,5])
m = pd.Series([2,4,6,8,10])
print(n)
print(m)
n[~n.isin(m)]

0    1
1    2
2    3
3    4
4    5
dtype: int64
0     2
1     4
2     6
3     8
4    10
dtype: int64

0    1
2    3
4    5
dtype: int64

In [40]:
#4. Write a Pandas program to filter words from a given series that contain at least two vowels. 
from collections import Counter
c = pd.Series(['Red', 'Green', 'Orange', 'Pink', 'Yellow', 'White'])
print("Original Series:")
print(c)
print("\nFiltered words:")
result = c.map(lambda c: sum([Counter(c.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
print(c[result])

Original Series:
0       Red
1     Green
2    Orange
3      Pink
4    Yellow
5     White
dtype: object

Filtered words:
1     Green
2    Orange
4    Yellow
5     White
dtype: object

In [64]:
#5.Consider the following as my DataFrame,Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.
a = pd.Series(["An","Di","ka","Ja","Em","Mi","Ma","La","Ke","Jo"])
b = pd.Series([12.5,9.0,16.5,"NaN",9.0,20.0,14.5,"Nan",8.,19.0])
c = pd.Series([1,3,2,3,2,3,1,1,2,1])
d = pd.Series(["yes","no","yes","no","no","yes","yes","no","no","yes"])
df = {"name":a,"score":b,"attempts":c,"qualify":d}
label = list("abcdefghij")
df1 = pd.DataFrame(df)
df1.set_index(pd.Index(label))
df1[df1["attempts"]>2]

  name score  attempts qualify
1   Di     9         3      no
3   Ja   NaN         3      no
5   Mi    20         3     yes